<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"39aa95fbbdc6b3f2175ff1a668bcd49dcaa944f35fcea2197a13c7545cc27006","plan_job_ref":"Job Plan Terraform for Warehouse and DAG changes #805 at https://github.com/cal-itp/data-infra/actions/runs/18545500470","plan_out_hash":"fafde6579d00709b6be1c3f7bd9c00ed29a09877a23ddb1d22bd5a3fbb37ead6","plan_hash":"b2b410288e3fb0c9d7b44f68f20b981188801b58e20328df51aa51ec48716051","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 3 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/mart/audit/fct_bigquery_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "8oQKyQ==" -> (known after apply)
!~      detect_md5hash      = "9Z9rHfKw3TrjHamBf2rxzw==" -> "different hash"
!~      generation          = 1751416664268286 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
!~      md5hash             = "9Z9rHfKw3TrjHamBf2rxzw==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/fct_bigquery_data_access.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/audit/fct_bigquery_data_access_referenced_tables.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "M4pcng==" -> (known after apply)
!~      detect_md5hash      = "9R3NrBuYzHdL31cZq7MfDQ==" -> "different hash"
!~      generation          = 1751416668087648 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/audit/fct_bigquery_data_access_referenced_tables.sql"
!~      md5hash             = "9R3NrBuYzHdL31cZq7MfDQ==" -> (known after apply)
        name                = "data/warehouse/models/mart/audit/fct_bigquery_data_access_referenced_tables.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "ultxqA==" -> (known after apply)
!~      detect_md5hash      = "uf6n7Bjzg3ahiWtpVDKgRg==" -> "different hash"
!~      generation          = 1755731202886127 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
!~      md5hash             = "uf6n7Bjzg3ahiWtpVDKgRg==" -> (known after apply)
        name                = "data/warehouse/models/staging/audit/stg_audit__cloudaudit_googleapis_com_data_access.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Terraform for Warehouse and DAG changes #805](https://github.com/cal-itp/data-infra/actions/runs/18545500470)